[
    "I’m unemployed because of the game ‘Among Us’.\n\nOh my fucking god guys I am fucking fuming. So the other day at work my boss told us that he recently discovered the video game Among Us, and ever since, his behaviour has become rather concerning. He now refers to me and my coworkers as 'crewmates'. Last Wednesday, when he noticed my teenage colleague slacking off at his workstation, he yelled at him saying he was \"faking his tasks\" and is \"acting sus\". I confronted my boss telling him that his behaviour lately has been egregious and immature, and he proceeded to call me an idiot and yelled \"kicked!\" The next day I caught him dancing around in his office blasting \"among drip\" from his desktop at full volume. I entered his office to kindly ask him to turn off the music since it was distracting to me and my coworkers. He looked at me angrily, telling me he has called an \"emergency meeting\", instructing me to have a seat. I asked him what was the matter and he told me that I have been acting extremely \"sus\". He repeatedly yelled \"you're the impostor\", telling me to say goodbye to my job because I have been \"ejected\". I fucking lost my job and I don't know what to do. Please help me Reddit! I have nowhere else to turn.",
    "My 12 year old little sister called my older sister it yesterday. And my mom heard and asked what it meant. Little sister said it’s something cute to call someone as a cover up. Now my mom calls us sussy bakas. Someone kill me.",
    "ur sus! ur suuuus. I said YOU ARE SUS, hahahahaha. Why arent you laughing? I just made a reference to the popular video game \"Among Us\"! How can you not laugh at it? Emergeny meeting! Guys, this here guy doesnt laugh at my funny Among Us memes! Lets beat him to death! Dead body reported! Skip! Skip! Vote blue! Blue was not an impostor. Among us in a nutshell hahahaha. What?! Youre still not laughing your ass off? I made SEVERAL funny references to Among Us and YOU STILL ARENT LAUGHING??!!! Bruh. Ya hear that? Wooooooosh. Whats woooosh? Oh, nothing. Just the sound of a joke flying over your head. Whats that? You think im annoying? Kinda sus, bro. Hahahaha! Anyway, yea, gotta go do tasks. Hahahaha!",
    "Wh- when when th- wh-when the-uh w-w-w-when the when the impo- when the impo-poster when the imposter i-is wh-when the imposter isssssss-uh when the imposter is sus!",
    "Wh- when when th- wh-when the-uh w-w-w-when the when the impo- when the impo-poster when the imposter i-is wh-when the imposter isssssss-uh when the imposter is sus!",
    "Okay so \"sussy\" comes from \"sus\" which comes from the \"suspicious\" and the term was popularized by a children's game called \"among us\" which is similar to \"mafia\" or \"werewolf\" if you've ever played them. \"Sus\" is used to describe someone believe to be the \"imposter\" or bad guy. It is also a deragatory term used to describe someone suspected of being gay. The connotation of the word \"sus\" or \"sussy\" depends on the context of the situation.",
    "If you shit in the sink at exactly 4:20 am and yell “amogus” 69 times,a shadowy figured called mom will come to beat you up and you will wake up in a place called the orphanage",
    "STOP POSTING ABOUT AMONG US! I'M TIRED OF SEEING IT! MY FRIENDS ON TIKTOK SEND ME MEMES, ON DISCORD IT'S FUCKING MEMES! I was in a server, right? and ALL OF THE CHANNELS were just among us stuff. I-I showed my champion underwear to my girlfriend and t-the logo I flipped it and I said \"hey babe, when the underwear is sus HAHA DING DING DING DING DING DING DING DI DI DING\" I fucking looked at a trashcan and said \"THAT'S A BIT SUSSY\" I looked at my penis I think of an astronauts helmet and I go \"PENIS? MORE LIKE PENSUS\""
]